# day13_ex2

# 정규표현식(Regular Expression)
# : 문자열 내에서 특정 패턴을 만족하는 문자열을 탐색, 존재 여부 확인, 치환할때 사용

# 패턴 문자열
'''
. : 임의의 문자하나
^ : 문자열 시작
$ : 문자열 끝
* : 0개 이상 반복
+ : 1개 이상 반복
? : 0개 또는 1개
{n} : n번 반복
{n,} : n번 이상 반복
{n,m} : n번 이상, m번 이하 반복
[] : 문자 집합
() : 캡춰링 (탐색한 것을 저장)
\d : 숫자 하나 = [0-9]
\D : 숫자가 아닌 문자 하나
\w : 워드 문자 하나 (워드 문자 : 영문대소문자 또는 숫자 또는 _문자)
\W : 워드 문자가 아닌 문자 하나
\s : 공백 문자하나 (스페이스, 엔터, 탭 ... )
\S : 공백문자가 아닌 문자 하나
[a-z] : 소문자 a부터 z 까지 문자 중 하나 = 영문 소문자 하나
[A-Z] : 대문자 A부터 Z까지 문자 중 하나 = 영문 대문자 하나
[0-9] : 숫자 하나
[가-힣] : 한글문자 하나
'''
from util.print_util import pp

# 패턴 옵션
'''
i (ignorecase) : 대소문자 구별없이 탐색
g (global) : 전체 영역에서 탐색
m (multi-line) : 문자열이 여러 줄로 되어 있을때 여러 각 줄의 처음과 끝에서 탐색
'''

pp()
import re # 정규표현식 사용을 위한 표준라이브러리
text = '주문번호 A1023, 금액 45,000원'

# re.findall(패턴문자열, 원복문자열)
# 원복 문자열에서 패턴을 따르는 문자열들의 리스트를 반환
nums = re.findall(r'\d+', text) # 숫자가 1개이상 패턴
pp(nums)  #['1023', '45', '000']

# re.search(패턴문자열, 원본문자열)
# 원본문자열에서 패턴을 따르는 문자열이 있으면 True 반환
if re.search(r'금액', text): # '금'이 오고 '액'이 오는 패턴
    pp('"금액"이라는 문자열이 있음!')

#re.sum(패턴문자열, 대체문자열, 원본문자열)
# 원본문자열에서 패턴을 따르는 문자열을 대체문자열로 치환
clean = re.sub(r',','',text)
pp(clean)









































